
## Plan Result (demo)




### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 2 to add, 4 to change, 2 to destroy.</code></pre>

* Update
  * module.apim_apis.azurerm_api_management_api_operation_policy.apim_api_operation_policies[&#34;elinks-health&#34;]
  * module.apim_apis.azurerm_api_management_api_operation_policy.apim_api_operation_policies[&#34;get-people&#34;]
  * module.apim_apis.azurerm_api_management_api_operation_policy.apim_api_operation_policies[&#34;get-people-by-params&#34;]
  * module.apim_apis.azurerm_api_management_api_operation_policy.apim_api_operation_policies[&#34;update-people&#34;]
* Replace
  * azurerm_role_assignment.app_insight_viewers[0]
  * azurerm_role_assignment.app_insight_viewers_monitoring[0]


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_role_assignment.app_insight_viewers[0] must be replaced
-/+ resource "azurerm_role_assignment" "app_insight_viewers" {
      ~ id                                     = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.ApiManagement/service/sds-api-mgmt-demo/loggers/sds-api-mgmt-demo-logger/providers/Microsoft.Authorization/roleAssignments/b0f7ece4-f3ad-9c24-0e0b-2dec72775ea3" -> (known after apply)
      ~ name                                   = "b0f7ece4-f3ad-9c24-0e0b-2dec72775ea3" -> (known after apply)
      ~ principal_id                           = "6490ec76-a586-4736-a586-e35ca0a24967" -> "/groups/6490ec76-a586-4736-a586-e35ca0a24967" # forces replacement
      ~ principal_type                         = "Group" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/providers/Microsoft.Authorization/roleDefinitions/ae349356-3a1b-4a5e-921d-050484c6347e" -> (known after apply)
      + skip_service_principal_aad_check       = (known after apply)
        # (6 unchanged attributes hidden)
    }

  # azurerm_role_assignment.app_insight_viewers_monitoring[0] must be replaced
-/+ resource "azurerm_role_assignment" "app_insight_viewers_monitoring" {
      ~ id                                     = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Insights/components/sds-api-mgmt-demo/providers/Microsoft.Authorization/roleAssignments/08dae3d6-b728-a82a-28c4-64316c72381a" -> (known after apply)
      ~ name                                   = "08dae3d6-b728-a82a-28c4-64316c72381a" -> (known after apply)
      ~ principal_id                           = "6490ec76-a586-4736-a586-e35ca0a24967" -> "/groups/6490ec76-a586-4736-a586-e35ca0a24967" # forces replacement
      ~ principal_type                         = "Group" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/providers/Microsoft.Authorization/roleDefinitions/43d0d8ad-25c7-4714-9337-8ba259a9fe05" -> (known after apply)
      + skip_service_principal_aad_check       = (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.apim_apis.azurerm_api_management_api_operation_policy.apim_api_operation_policies["elinks-health"] will be updated in-place
  ~ resource "azurerm_api_management_api_operation_policy" "apim_api_operation_policies" {
        id                  = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.ApiManagement/service/sds-api-mgmt-demo/apis/hmi-apim/operations/elinks-health"
      ~ xml_content         = (sensitive value)
        # (4 unchanged attributes hidden)
    }

  # module.apim_apis.azurerm_api_management_api_operation_policy.apim_api_operation_policies["get-people"] will be updated in-place
  ~ resource "azurerm_api_management_api_operation_policy" "apim_api_operation_policies" {
        id                  = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.ApiManagement/service/sds-api-mgmt-demo/apis/hmi-apim/operations/get-people"
      ~ xml_content         = (sensitive value)
        # (4 unchanged attributes hidden)
    }

  # module.apim_apis.azurerm_api_management_api_operation_policy.apim_api_operation_policies["get-people-by-params"] will be updated in-place
  ~ resource "azurerm_api_management_api_operation_policy" "apim_api_operation_policies" {
        id                  = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.ApiManagement/service/sds-api-mgmt-demo/apis/hmi-apim/operations/get-people-by-params"
      ~ xml_content         = (sensitive value)
        # (4 unchanged attributes hidden)
    }

  # module.apim_apis.azurerm_api_management_api_operation_policy.apim_api_operation_policies["update-people"] will be updated in-place
  ~ resource "azurerm_api_management_api_operation_policy" "apim_api_operation_policies" {
        id                  = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.ApiManagement/service/sds-api-mgmt-demo/apis/hmi-apim/operations/update-people"
      ~ xml_content         = (sensitive value)
        # (4 unchanged attributes hidden)
    }

Plan: 2 to add, 4 to change, 2 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":129,"Program":"tfcmt","SHA1":"","Target":"demo","Vars":{}} -->